name: "sub2_vgg"
layer {
  name: "MyData"
  type: "HDF5Data"
  top: "data"
  top: "label"
  top: "pose"
  hdf5_data_param {
    source: "/home/hkk/DATACENTER/hdf5/box_train_bgr_data_list.txt"
    batch_size: 70
    shuffle: true
  }
  include: { phase: TRAIN }
}
layer {
  name: "MyData"
  type: "HDF5Data"
  top: "data"
  top: "label"
  top: "pose"
  hdf5_data_param {
    source: "/home/hkk/DATACENTER/hdf5/box_train_bgr_data_list.txt"
    batch_size: 20
  }
  include: { phase: TEST }
}

layer {
  bottom: "data"
  top: "conv1"
  name: "conv1"
  type: "Convolution"
  convolution_param {
    num_output: 96
    kernel_size: 7
    stride: 2
  }
}
layer {
  bottom: "conv1"
  top: "conv1"
  name: "relu1"
  type: "ReLU"
}
layer {
  bottom: "conv1"
  top: "norm1"
  name: "norm1"
  type: "LRN"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
layer {
  bottom: "norm1"
  top: "pool1"
  name: "pool1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 3
  }
}
layer {
  bottom: "pool1"
  top: "conv2"
  name: "conv2"
  type: "Convolution"
  convolution_param {
    num_output: 256
    kernel_size: 5
  }
}
layer {
  bottom: "conv2"
  top: "conv2"
  name: "relu2"
  type: "ReLU"
}
layer {
  bottom: "conv2"
  top: "pool2"
  name: "pool2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool2"
  top: "conv3"
  name: "conv3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3"
  top: "conv3"
  name: "relu3"
  type: "ReLU"
}
layer {
  bottom: "conv3"
  top: "conv4"
  name: "conv4"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4"
  top: "conv4"
  name: "relu4"
  type: "ReLU"
}

layer {
  bottom: "conv4"
  top: "conv5"
  name: "conv5"
  type: "Convolution"

  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5"
  top: "conv5"
  name: "relu5"
  type: "ReLU"
}
layer {
  bottom: "conv5"
  top: "pool5"
  name: "pool5"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 3
  }
}
layer {
  bottom: "pool5"
  top: "fc6"
  name: "fc6"
  type: "InnerProduct"

  inner_product_param {
    num_output: 4096
  }
}
layer {
  bottom: "fc6"
  top: "fc6"
  name: "relu6"
  type: "ReLU"
}
layer {
  bottom: "fc6"
  top: "fc6"
  name: "drop6"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  bottom: "fc6"
  top: "fc7"
  name: "fc7"
  type: "InnerProduct"

  inner_product_param {
    num_output: 4096
  }
}
layer {
  bottom: "fc7"
  top: "fc7"
  name: "relu7"
  type: "ReLU"
}
layer {
  bottom: "fc7"
  top: "fc7"
  name: "drop7"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  bottom: "fc7"
  top: "68point"
  name: "68point"
  type: "InnerProduct"
  inner_product_param {
    num_output: 136
  }
}
layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "68point"
  bottom: "label"
  top: "loss"
  loss_weight: 1
}


layer {
  bottom: "conv4"
  top: "conv5_b"
  name: "conv5_b"

  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_b"
  top: "conv5_b"
  name: "relu5_b"
  type: "ReLU"
}
layer {
  bottom: "conv5_b"
  top: "pool5_b"
  name: "pool5_b"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 3
  }
}
layer {
  bottom: "pool5_b"
  top: "fc6_b"
  name: "fc6_b"
  type: "InnerProduct"

  inner_product_param {
    num_output: 4096
  }
}
layer {
  bottom: "fc6_b"
  top: "fc6_b"
  name: "relu6_b"
  type: "ReLU"
}
layer {
  bottom: "fc6_b"
  top: "fc6_b"
  name: "drop6_b"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  bottom: "fc6_b"
  top: "fc7_b"
  name: "fc7_b"
  type: "InnerProduct"

  inner_product_param {
    num_output: 4096
  }
}
layer {
  bottom: "fc7_b"
  top: "fc7_b"
  name: "relu7_b"
  type: "ReLU"
}
layer {
  bottom: "fc7_b"
  top: "fc7_b"
  name: "drop7_b"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  bottom: "fc7_b"
  top: "poselayer"
  name: "poselayer"
  type: "InnerProduct"
  inner_product_param {
    num_output: 3
  }
}
layer {
  name: "poseLoss"
  type: "EuclideanLoss"
  bottom: "poselayer"
  bottom: "pose"
  top: "poseLoss"
  loss_weight: 3
}
